app/views/races/index.html.erb

        <td><%= link_to race.date.strftime('%m/%d/%Y'), race_path(race) %></td>
        <td><%= race.results.count %></td>
---
SELECT COUNT(*) AS count_all, race_id AS race_id FROM "results" GROUP BY "results"."race_id"