app/views/racers/index.html.erb

SELECT "racers".* FROM "racers" WHERE (first_name LIKE '%Metcalfe%' OR last_name LIKE '%Metcalfe%')
---
        <tr>
          <td><%= link_to Racer.find(result[0]).first_name + " " + Racer.find(result[0]).last_name, racer_path(Racer.find(result[0])) %></td>