app/views/racers/index.html.erb

          <td><%= racer.last_name %></td>
          <td><%= link_to racer.results.count.to_s, racer_path(racer) %></td>
---
SELECT COUNT(*) FROM "results" WHERE "results"."racer_id" = $1  [["racer_id", 333]]