app/controllers/racers_controller.rb

  def index
    begin
      logger.info "[Racers#index] Starting index action"
      puts "[Racers#index] Starting index action"
      logger.info "[Racers#index] params: #{params.inspect}"
      puts "[Racers#index] params: #{params.inspect}"

      # Base query with default ordering
      base_query = Racer.order("race_count DESC")
      logger.info "[Racers#index] Base query built"

      # Apply search if present
      if params[:search].present?
        logger.info "[Racers#index] search term: #{params[:search]}"
        base_query = base_query.search(params[:search])
---
SELECT "racers".* FROM "racers" WHERE (first_name LIKE '%Metcalfe%' OR last_name LIKE '%Metcalfe%')