app/controllers/races_controller.rb

SELECT "races".* FROM "races"  ORDER BY "races"."date" ASC
---
  def index
    @races = Race.all
    if params[:search]
      @races = Race.search(params[:search])
    end
    @races_to_show = @races.order("date DESC")